ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/system_SWM330.c
/*******************************************************************************************************************************
* @brief	system clock setting
*
*
********************************************************************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH CODING INFORMATION 
* REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A RESULT, SYNWIT SHALL NOT BE HELD LIABLE 
* FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT 
* OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN CONN-
* -ECTION WITH THEIR PRODUCTS.
*
* COPYRIGHT 2012 Synwit Technology 
*******************************************************************************************************************************/
#include <stdint.h>
#include "SWM330.h"


/*******************************************************************************************************************************
 * system clock setting
 ******************************************************************************************************************************/
#define SYS_CLK_8MHz		0	 	// 0 internal 8MHz
#define SYS_CLK_1MHz		1		// 1 internal 1MHz
#define SYS_CLK_XTAL		2		// 4 external XTAL (4-32MHz)
#define SYS_CLK_XTAL_DIV8	3		// 5 external XTAL (4-32MHz) divide by 8
#define SYS_CLK_PLL			4		// 6 PLL output
#define SYS_CLK_PLL_DIV8	5		// 7 PLL output divide by 8
#define SYS_CLK_32KHz		6		// 8 internal 32KHz
#define SYS_CLK_XTAL_32K	7		// 9 exteranl 32KHz XTAL

#define SYS_CLK   SYS_CLK_PLL


#define __HSI		( 8000000UL)	// high speed internal clock
#define __LSI		(   32000UL)	// low speed internal clock
#define __HSE		( 8000000UL)	// high speed external clock
#define __LSE		(   32768UL)	// low speed external clock


/********************************** PLL setting ********************************************************************************
 * VCO output frequency = PLL input frequency / INDIV * FBDIV
 * PLL output frequency = PLL input frequency / INDIV * FBDIV / OUTDIV = VCO output frequency / OUTDIV
 * note: VCO output frequency shoud be in range [80MHz, 240MHz]
 ******************************************************************************************************************************/ 
#define SYS_PLL_SRC   	SYS_CLK_XTAL	// SYS_CLK_8MHz or SYS_CLK_XTAL

#define PLL_IN_DIV		2

#define PLL_FB_DIV		50

#define PLL_OUT_DIV		2



uint32_t SystemCoreClock  = __HSI;   				// System Clock Frequency (Core Clock)
uint32_t CyclesPerUs      = (__HSI / 1000000); 		// Cycles per micro second


/*******************************************************************************************************************************
* @brief	This function is used to update the variable SystemCoreClock and must be called whenever the core clock is changed
* @param
* @param
* @return
*******************************************************************************************************************************/
void SystemCoreClockUpdate(void)    
{
	if(SYS->CLKSEL & SYS_CLKSEL_SYS_Msk)			//SYS  <= HRC
	{
		SystemCoreClock = __HSI;
	}
	else											//SYS  <= CLK
	{
		switch((SYS->CLKSEL & SYS_CLKSEL_CLK_Msk) >> SYS_CLKSEL_CLK_Pos)
		{
		case 0:
			SystemCoreClock = __LSI;
			break;
		
		case 1:
			if(SYS->PLLCR & SYS_PLLCR_INSEL_Msk)			//PLL_IN <= XTAL
			{
				SystemCoreClock = __HSE;
			}
			else											//PLL_IN <= HRC
			{
				SystemCoreClock = __HSI;
			}
			
			uint32_t indiv  = ((SYS->PLLDIV & SYS_PLLDIV_INDIV_Msk)  >> SYS_PLLDIV_INDIV_Pos) + 1;
			uint32_t fbdiv  = ((SYS->PLLDIV & SYS_PLLDIV_FBDIV_Msk)  >> SYS_PLLDIV_FBDIV_Pos);
			uint32_t outdiv = ((SYS->PLLDIV & SYS_PLLDIV_OUTDIV_Msk) >> SYS_PLLDIV_OUTDIV_Pos) + 1;
			
			SystemCoreClock = SystemCoreClock / indiv * fbdiv / outdiv;
			break;
		
		case 2:
			SystemCoreClock = __LSE;
			break;
		
		case 3:
			SystemCoreClock = __HSE;
			break;
		
		case 4:
			SystemCoreClock = __HSI;
			break;
		}
		
		if(SYS->CLKSEL & SYS_CLKSEL_CLK_DIVx_Msk)  SystemCoreClock /= 8;
	}
	
	CyclesPerUs = SystemCoreClock / 1000000;
	
	if(CyclesPerUs == 0)
		CyclesPerUs = 1;
}


/*******************************************************************************************************************************
* @brief	The necessary initializaiton of systerm
* @param
* @param
* @return
*******************************************************************************************************************************/
void SystemInit(void)
{
	SYS->CLKEN1 |= (1 << SYS_CLKEN1_ANAC_Pos);
	
	LDO_1V8_On(RTC_CLKSRC_LRC32K);	// Power for PSRAM and PE0-11, PE14, PA5 pin
	
	Flash_Param_at_xMHz(150);
	
	switch(SYS_CLK)
	{
		case SYS_CLK_8MHz:
			switchTo8MHz();
			break;
		
		case SYS_CLK_1MHz:
			switchTo1MHz();
			break;
		
		case SYS_CLK_XTAL:
			switchToXTAL(0);
			break;
		
		case SYS_CLK_XTAL_DIV8:
			switchToXTAL(1);
			break;
		
		case SYS_CLK_PLL:
			switchToPLL(SYS_PLL_SRC == SYS_CLK_XTAL, PLL_IN_DIV, PLL_FB_DIV, PLL_OUT_DIV, 0);
			break;
		
		case SYS_CLK_PLL_DIV8:
			switchToPLL(SYS_PLL_SRC == SYS_CLK_XTAL, PLL_IN_DIV, PLL_FB_DIV, PLL_OUT_DIV, 1);
			break;
		
		case SYS_CLK_32KHz:
			switchTo32KHz();
			break;
		
		case SYS_CLK_XTAL_32K:
			switchToXTAL_32K();
			break;
	}
	
	SystemCoreClockUpdate();
	
	Flash_Param_at_xMHz(CyclesPerUs);
	
	IAP_Cache_Config(FMC->CACHE | FMC_CACHE_CEN_Msk | FMC_CACHE_CCLR_Msk, 0x0B11FFAC);	// Cache enable
	
	PORTC->PULLD &= ~(1 << PIN5);
	PORTB->PULLD &= ~(1 << PIN8);
	PORTB->PULLU &= ~((1 << PIN9) | (1 << PIN10));
}


static void delay_3ms(void)
{
	uint32_t i;
	
	if(((SYS->CLKSEL & SYS_CLKSEL_SYS_Msk) == 0) &&
	   ((((SYS->CLKSEL & SYS_CLKSEL_CLK_Msk) >> SYS_CLKSEL_CLK_Pos) == 0) ||   //LSI 32KHz
	    (((SYS->CLKSEL & SYS_CLKSEL_CLK_Msk) >> SYS_CLKSEL_CLK_Pos) == 2)))	   //LSE 32KHz
	{
		for(i = 0; i < 20; i++) __NOP();
	}
	else
	{
		for(i = 0; i < 20000; i++) __NOP();
	}
}


void switchTo8MHz(void)
{
	SYS->RCCR |= (1 << SYS_RCCR_HON_Pos);
	
	delay_3ms();
	
	SYS->CLKSEL |= (1 << SYS_CLKSEL_SYS_Pos);		//SYS <= HRC
}

void switchTo1MHz(void)
{
	switchTo8MHz();
	
	SYS->CLKDIVx_ON = 1;
	
	SYS->CLKSEL &= ~SYS_CLKSEL_CLK_Msk;
	SYS->CLKSEL |= (4 << SYS_CLKSEL_CLK_Pos);		//CLK <= HRC

	SYS->CLKSEL |= (1 << SYS_CLKSEL_CLK_DIVx_Pos);
	
	delay_3ms();
	
	SYS->CLKSEL &=~(1 << SYS_CLKSEL_SYS_Pos);		//SYS <= HRC/8
}

void switchToXTAL(uint32_t div8)
{
	switchTo8MHz();
	
	PORT_Init(PORTA, PIN3, PORTA_PIN3_XTAL_IN,  0);
	PORT_Init(PORTA, PIN4, PORTA_PIN4_XTAL_OUT, 0);
	SYS->XTALCR |= (1 << SYS_XTALCR_ON_Pos);
	
	SYS->CLKDIVx_ON = 1;
	
	SYS->CLKSEL &= ~SYS_CLKSEL_CLK_Msk;
	SYS->CLKSEL |= (3 << SYS_CLKSEL_CLK_Pos);		//CLK <= XTAL

	if(div8) SYS->CLKSEL |= (1 << SYS_CLKSEL_CLK_DIVx_Pos);
	else     SYS->CLKSEL &=~(1 << SYS_CLKSEL_CLK_DIVx_Pos);
	
	delay_3ms();
	
	SYS->CLKSEL &=~(1 << SYS_CLKSEL_SYS_Pos);		//SYS <= XTAL
}

void switchToPLL(uint32_t clksrc_xtal, uint32_t indiv, uint32_t fbdiv, uint32_t outdiv, uint32_t div8)
{
	switchTo8MHz();
	
	if(clksrc_xtal == 0)
	{
		SYS->RCCR |= (1 << SYS_RCCR_HON_Pos);
		
		SYS->PLLCR &= ~(1 << SYS_PLLCR_INSEL_Pos);	//PLL_SRC <= HRC
	}
	else
	{
		PORT_Init(PORTA, PIN3, PORTA_PIN3_XTAL_IN,  0);
		PORT_Init(PORTA, PIN4, PORTA_PIN4_XTAL_OUT, 0);
		SYS->XTALCR |= (1 << SYS_XTALCR_ON_Pos);
		
		SYS->PLLCR |= (1 << SYS_PLLCR_INSEL_Pos);	//PLL_SRC <= XTAL
	}
	
	SYS->PLLDIV &= ~(SYS_PLLDIV_INDIV_Msk |
					 SYS_PLLDIV_FBDIV_Msk |
					 SYS_PLLDIV_OUTDIV_Msk);
	SYS->PLLDIV |= ((indiv - 1)  << SYS_PLLDIV_INDIV_Pos) |
				   ( fbdiv		 << SYS_PLLDIV_FBDIV_Pos) |
				   ((outdiv - 1) << SYS_PLLDIV_OUTDIV_Pos);
	
	SYS->PLLCR &= ~(1 << SYS_PLLCR_OFF_Pos);
	
	while((SYS->PLLCR & SYS_PLLCR_LOCK_Msk) == 0) __NOP();	// wait for PLL to lock
	
	SYS->PLLCR |= (1 << SYS_PLLCR_OUTEN_Pos);
	
	SYS->CLKDIVx_ON = 1;
	
	SYS->CLKSEL &= ~SYS_CLKSEL_CLK_Msk;
	SYS->CLKSEL |= (1 << SYS_CLKSEL_CLK_Pos);		//CLK <= PLL

	if(div8)  SYS->CLKSEL |= (1 << SYS_CLKSEL_CLK_DIVx_Pos);
	else      SYS->CLKSEL &=~(1 << SYS_CLKSEL_CLK_DIVx_Pos);
	
	SYS->CLKSEL &=~(1 << SYS_CLKSEL_SYS_Pos);		//SYS <= PLL
}

void switchTo32KHz(void)
{
	switchTo8MHz();
	
	SYS->RCCR |= (1 << SYS_RCCR_LON_Pos);
	
	SYS->CLKDIVx_ON = 1;
	
	SYS->CLKSEL &= ~SYS_CLKSEL_CLK_Msk;
	SYS->CLKSEL |= (0 << SYS_CLKSEL_CLK_Pos);		//CLK <= LRC

	SYS->CLKSEL &=~(1 << SYS_CLKSEL_CLK_DIVx_Pos);
	
	delay_3ms();

	SYS->CLKSEL &=~(1 << SYS_CLKSEL_SYS_Pos);		//SYS <= LRC
}

void switchToXTAL_32K(void)
{
	switchTo8MHz();
	
	SYS->CLKEN1 |= SYS_CLKEN1_RTC_Msk;
	RTC_unlock(RTC);
	RTC->X32KCR |= RTC_X32KCR_ON_Msk;
	RTC_lock(RTC);
	
	SYS->CLKDIVx_ON = 1;
	
	SYS->CLKSEL &= ~SYS_CLKSEL_CLK_Msk;
	SYS->CLKSEL |= (2 << SYS_CLKSEL_CLK_Pos);		//CLK <= XTAL_32K

	SYS->CLKSEL &=~(1 << SYS_CLKSEL_CLK_DIVx_Pos);
	
	delay_3ms();

	SYS->CLKSEL &=~(1 << SYS_CLKSEL_SYS_Pos);		//SYS <= XTAL_32K
}


void SW_DelayUS(uint32_t us)
{
	us = CyclesPerUs * us / 4;
	
	for(int i = 0; i < us; i++) __NOP();
}

void SW_DelayMS(uint32_t ms)
{
	for(int i = 0; i < ms; i++) SW_DelayUS(1000);
}


/*******************************************************************************************************************************
* @brief	1.8V LDO (Power for PSRAM and PE0-11, PE14, PA5 pin) turn on
* @param	clksrc is RTC clock source, can be RTC_CLKSRC_LRC32K or RTC_CLKSRC_XTAL32K
* @return
*******************************************************************************************************************************/
void LDO_1V8_On(uint32_t clksrc)
{
	SYS->CLKEN1 |= SYS_CLKEN1_RTC_Msk;
	
	if(clksrc == RTC_CLKSRC_XTAL32K)
	{
		RTC->X32KCR |= RTC_X32KCR_ON_Msk;
	}
	else
	{
		SYS->RCCR |= SYS_RCCR_LON_Msk;
	}
	
	for(int i = 0; i < CyclesPerUs * 10; i++) __NOP();
	
	RTC->PWRCR |= RTC_PWRCR_LDO1V8_Msk;
}
